app/controllers/users_controller.rb

  def index
    if session[:kind] == 2
      @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id]) rescue nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "672557606"]]

  def edit
    @user = User.find(params[:id]) rescue nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "672557606"]]

  def create
    begin
      if session[:kind] == 2 || !session[:kind]
        @user = User.new(params[:user])
        if @user.save
---
INSERT INTO "users" ("about", "age", "code", "created_at", "email", "name", "phone", "tested", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    begin
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "672557606"]]

  def destroy
    @user = User.find(params[:id])
    flash[:notice] = "Usuario apagado com sucesso" if @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "672557606"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 672557606]]